{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Big Data Modeling and Management Assigment - Homework 1"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 🍺 The Beer project  🍺 \n",
    "\n",
    "Graph databases are a natural way of navigating distinct types of data. For this first project we will be taking a graph database to analyse beer and breweries!   \n",
    "\n",
    "_For reference the dataset used for this project has been extracted from [kaggle](https://www.kaggle.com/ehallmar/beers-breweries-and-beer-reviews), released by Evan Hallmark. Even though the author does not present metadata on the origin of the data it is probably a collection of open data from places like [beeradvocate](https://www.beeradvocate.com/)_.\n",
    "\n",
    "### Problem description\n",
    "\n",
    "Explore the database via python neo4j connector and/or the graphical tool in the NEO4J webpage. Answer the questions with python syntax. Submit the results by following the instructions.\n",
    "\n",
    "### Answered\n",
    "\n",
    "1. DONE\n",
    "2. DONE\n",
    "3. DONE\n",
    "4. DONE\n",
    "5. DONE\n",
    "6. NEED TO SEE\n",
    "7. DONE\n",
    "8. TODO - UNDERSTOOD QUESTION WRONG\n",
    "9. DONE\n",
    "10. DONE\n",
    "11. DONE\n",
    "\n",
    "### Questions\n",
    "\n",
    "1. How many distinct countries exist in the database? [Hint: mind repetitions]\n",
    "1. Most reviews:  \n",
    "    1. Which `Beer` has the most reviews?  \n",
    "    1. Which `Brewery` has the most reviews for its beers? [Hint: 5-node path]\n",
    "    1. Which `Country` has the most reviews for its beers? [Hint: 5-node path]\n",
    "1. Who is/are the user/users that have the most shared reviews (reviews of the same beers) with the user CTJman?\n",
    "1. Which Portuguese brewery has the most beers?\n",
    "1. From those beers (the ones returned from the previous question), which has the most reviews?\n",
    "1. On average how many different beer styles does each brewery produce?\n",
    "1. Which brewery produces the strongest beers according to ABV? [Hint: database has NaN values]\n",
    "1. If I typically enjoy a beer due to its aroma and appearance, which beer style should I try? (Justify your answer) [Hint: database has NaN values]\n",
    "1. Using Graph Algorithms answer **one** of the following questions: [NB: make sure to clear the graph before using it again]\n",
    "    1. Which two countries are most similiar when it comes to their **top 10** most produced Beer styles?\n",
    "    2. Which beer is the most influential when considering the number of users who reviewed it? [Please use limit of 1000 on beer-review-user path]]\n",
    "    3. Users are connected together by their reviews of beers, taking into consideration the \"overall\" score they assign as a weight, how many communities are formed from these relationships? How many users are in the largest community? [Please use limit of 1000 on beer-review-user path]]\n",
    "1. Using Graph Algorithms answer **one** of the following questions:\n",
    "    1. Which beer has the most similar reviews as the beer `Super Bock Stout`? [Hint:inspect two subsets: with and without the beer in question]\n",
    "    2. Which user is the most influential when it comes to reviews made?\n",
    "1. If you had to pick 3 beers to recommend using only this database, which would you pick and why? (Justify your answer) [Hint: database has NaN values]\n",
    "\n",
    "\n",
    "Questions 8 to 10 are somewhat open, which means we'll also be evaluating the reasoning behind your answer. So there aren't necessarily bad results there are only wrong criteria, explanations, or execution. \n",
    " \n",
    "### Groups  \n",
    "\n",
    "Groups should have 4 to 5 people.\n",
    "You should register your group on **moodle**.\n",
    "\n",
    "### Submission      \n",
    "\n",
    "The code used to produce the results and respective explanations should be uploaded to moodle. They should have a clear reference to the group, either on the file name or on the document itself (please submit one Jupyter notebook per group).\n",
    "\n",
    "### Evaluation   \n",
    "\n",
    "This will be 20% of the final grade.   \n",
    "Each solution will be evaluated on 2 components: correctness of results and simplicity of the solution.  \n",
    "All code will go through plagiarism automated checks. Groups with the same code will undergo investigation."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Loading the Database\n",
    "\n",
    "#### Be sure that you **don't have** the neo4j docker container from the classes running (you can Stop it in the desktop app or with the command \"`docker stop Neo4JLab`\")\n",
    "\n",
    "\n",
    "The default container does not have any data whatsoever, we will have to load a database into our docker image:\n",
    "- Download and unzip the `Neo4JHWData` file provided on Moodle (apr. 6 Gb).\n",
    "- Copy the path of the `Neo4JHWData` folder of the unziped file, e.g. `c:\\Users\\osavc\\Documents\\Nova_BDMM\\_2024\\Homework\\Neo4JHWData/data`.\n",
    "- Download and unzip the `Neo4JPlugins` file provided on Moodle (it is the same plugins as for the labs).\n",
    "- Copy the path of the `Neo4JPlugins` folder of the unziped file, e.g. `c:\\Users\\osavc\\Documents\\Nova_BDMM\\_2024\\Installations\\Neo4JPlugins`.\n",
    "- Change the code below to include your correct folder paths. Be sure that you have Docker running first:\n",
    "\n",
    "`docker run --name Neo4JHW -p 7474:7474 -p 7687:7687 -d -v \"/home/gui-moreira/Documents/NOVA/BDMM/project/Neo4JPlugins\":/plugins -v \"/home/gui-moreira/Documents/NOVA/BDMM/project/Neo4JHWData/data\":/data --env NEO4J_AUTH=neo4j/test --env NEO4J_dbms_connector_https_advertised__address=\"localhost:7473\" --env NEO4J_dbms_connector_http_advertised__address=\"localhost:7474\" --env NEO4J_dbms_connector_bolt_advertised__address=\"localhost:7687\" --env NEO4J_dbms_security_procedures_unrestricted=\"gds.*\" --env NEO4J_dbms_security_procedures_allowlist=\"gds.*\" neo4j:4.4.5`\n",
    "\n",
    "- Since Neo4j is trying to recognize a new database folder, this might take a bit  before you can view the data on Neo4j webpage (let's say 3 minutes)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {
    "ExecuteTime": {
     "end_time": "2024-02-29T23:16:45.833322Z",
     "start_time": "2024-02-29T23:16:44.269293Z"
    }
   },
   "outputs": [],
   "source": [
    "from neo4j import GraphDatabase\n",
    "from pprint import pprint"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {
    "ExecuteTime": {
     "end_time": "2024-02-29T23:16:46.537995Z",
     "start_time": "2024-02-29T23:16:46.522761Z"
    }
   },
   "outputs": [],
   "source": [
    "NEO4J_URI=\"neo4j://localhost:7687\"\n",
    "NEO4J_USERNAME=\"neo4j\"\n",
    "NEO4J_PASSWORD=\"test\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {
    "ExecuteTime": {
     "end_time": "2024-02-29T23:16:48.420923Z",
     "start_time": "2024-02-29T23:16:48.405549Z"
    }
   },
   "outputs": [],
   "source": [
    "driver = GraphDatabase.driver(NEO4J_URI, auth=(NEO4J_USERNAME, NEO4J_PASSWORD), )"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### All The Functions you'll need to run queries in Neo4J"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {
    "ExecuteTime": {
     "end_time": "2024-02-29T23:16:54.392239Z",
     "start_time": "2024-02-29T23:16:54.382827Z"
    }
   },
   "outputs": [],
   "source": [
    "def execute_read(driver, query):    \n",
    "    with driver.session(database=\"neo4j\") as session:\n",
    "        result = session.execute_read(lambda tx, query: list(tx.run(query)), query)\n",
    "    return result"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Understanding the Database"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {
    "ExecuteTime": {
     "end_time": "2024-02-29T23:16:55.777843Z",
     "start_time": "2024-02-29T23:16:55.715097Z"
    }
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[<Record label='COUNTRIES'>,\n",
      " <Record label='CITIES'>,\n",
      " <Record label='BREWERIES'>,\n",
      " <Record label='BEERS'>,\n",
      " <Record label='REVIEWS'>,\n",
      " <Record label='STYLE'>,\n",
      " <Record label='USER'>]\n"
     ]
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "        call db.labels();\n",
    "    \"\"\"\n",
    "\n",
    "result = execute_read(driver, query)\n",
    "\n",
    "pprint(result)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {
    "ExecuteTime": {
     "end_time": "2024-02-29T23:16:56.966382Z",
     "start_time": "2024-02-29T23:16:56.937451Z"
    }
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[<Record relationshipType='REVIEWED'>,\n",
      " <Record relationshipType='BREWED'>,\n",
      " <Record relationshipType='IN'>,\n",
      " <Record relationshipType='HAS_STYLE'>,\n",
      " <Record relationshipType='POSTED'>]\n"
     ]
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "        CALL db.relationshipTypes();\n",
    "    \"\"\"\n",
    "\n",
    "result = execute_read(driver, query)\n",
    "\n",
    "pprint(result)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Submission\n",
    "\n",
    "GROUP NUMBER:\n",
    "\n",
    "**XXXXXX**\n",
    "\n",
    "GROUP MEMBERS:\n",
    "\n",
    "|STUDENT NUMBER|STUDENT NAME|\n",
    "|---|---|\n",
    "|XXXXXX|XXXXXX|\n",
    "|XXXXXX|XXXXXX|\n",
    "|XXXXXX|XXXXXX|\n",
    "|XXXXXX|XXXXXX|\n",
    "|XXXXXX|XXXXXX|"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### 1. How many distinct countries exist in the database?"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[<Record distinct_countries=200>]\n"
     ]
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "        MATCH (c:COUNTRIES)\n",
    "        RETURN COUNT(DISTINCT c.name) as distinct_countries\n",
    "    \"\"\"\n",
    "\n",
    "result = execute_read(driver, query)\n",
    "\n",
    "pprint(result)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### 2. Most reviews:  \n",
    "    A) Which `Beer` has the most reviews?  \n",
    "    B) Which `Brewery` has the most reviews for its beers?\n",
    "    C) Which `Country` has the most reviews for its beers? "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[<Record b.name='IPA' reviews=31387>]\n"
     ]
    }
   ],
   "source": [
    "# A) Which Beer has the most reviews\n",
    "query = \"\"\"\n",
    "        MATCH (b:BEERS)-[:REVIEWED]->()\n",
    "        RETURN \n",
    "            b.name,\n",
    "            COUNT(*) AS reviews\n",
    "        ORDER BY reviews DESC\n",
    "        LIMIT 1\n",
    "    \"\"\"\n",
    "\n",
    "result = execute_read(driver, query)\n",
    "\n",
    "pprint(result)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 156,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[<Record br.name='Sierra Nevada Brewing Co.' reviews=175161>]\n"
     ]
    }
   ],
   "source": [
    "# B) Which brewery has the most reviews for its beers?\n",
    "query = \"\"\"\n",
    "        MATCH (br:BREWERIES)-[]->()-[]->(r:REVIEWS)\n",
    "        RETURN\n",
    "            br.name,\n",
    "            COUNT(r) AS reviews\n",
    "        ORDER BY reviews DESC\n",
    "        LIMIT 1\n",
    "    \"\"\"\n",
    "\n",
    "result = execute_read(driver, query)\n",
    "\n",
    "pprint(result)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 158,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[<Record c.name='US' reviews=7675804>]\n"
     ]
    }
   ],
   "source": [
    "# C) Which country has the most reviews for its beers?\n",
    "query = \"\"\"\n",
    "        MATCH (c:COUNTRIES)<-[]-()<-[]-()-[]->()-[]->(r:REVIEWS)\n",
    "        RETURN\n",
    "            c.name,\n",
    "            COUNT(r) AS reviews\n",
    "        ORDER BY reviews DESC\n",
    "        LIMIT 1\n",
    "    \"\"\"\n",
    "\n",
    "result = execute_read(driver, query)\n",
    "\n",
    "pprint(result)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### 3. Who is/are the user/users that have the most shared reviews (reviews of the same beers) with the user CTJman?"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[]\n"
     ]
    }
   ],
   "source": [
    "# Who is/are the user/users that have the most shared reviews (reviews of the same beers) with the user CTJman?\n",
    "\n",
    "# ?"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### 4. Which Portuguese brewery has the most beers?\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 151,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[<Record br.name='Dois Corvos Cervejeira' beers=40>]\n"
     ]
    }
   ],
   "source": [
    "# Which Portuguese brewery has the most beers?\n",
    "query = \"\"\"\n",
    "        MATCH (:COUNTRIES {name: 'PT'})<-[]-()<-[]-(br:BREWERIES)-[]->()\n",
    "        RETURN\n",
    "            br.name,\n",
    "            COUNT(*) AS beers\n",
    "        ORDER BY beers DESC\n",
    "        LIMIT 1\n",
    "    \"\"\"\n",
    "\n",
    "result = execute_read(driver, query)\n",
    "\n",
    "pprint(result)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### 5. From those beers (the ones produced in the brewery from the previous question), which has the most reviews?\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[<Record b.name='Finisterra' reviews=10>]\n"
     ]
    }
   ],
   "source": [
    "# From those beers (the ones produced in the brewery from the previous question), which has the most reviews?\n",
    "query = \"\"\"\n",
    "        MATCH (:BREWERIES {name: 'Dois Corvos Cervejeira'})-[]->(b:BEERS)-[r:REVIEWED]->()\n",
    "        RETURN\n",
    "            b.name,\n",
    "            COUNT(r) AS reviews\n",
    "        ORDER BY reviews DESC\n",
    "        LIMIT 1\n",
    "    \"\"\"\n",
    "\n",
    "result = execute_read(driver, query)\n",
    "\n",
    "pprint(result)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### 6. On average how many different beer styles does each brewery produce?"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 42,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[<Record AVG(num_styles)=10.66991600760218>]\n"
     ]
    }
   ],
   "source": [
    "# On average how many different beer styles does each brewery produce?\n",
    "\n",
    "query = \"\"\"\n",
    "        MATCH (br:BREWERIES)-[:BREWED]->(b:BEERS)-[hs:HAS_STYLE]->(s:STYLE)\n",
    "        WHERE s.name <> 'nan'\n",
    "        WITH DISTINCT br.name as brewery_name, COUNT(distinct s.name) as num_styles\n",
    "        RETURN AVG(num_styles)\n",
    "    \"\"\"\n",
    "\n",
    "result = execute_read(driver, query)\n",
    "\n",
    "pprint(result)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### 7. Which brewery produces the strongest beers according to ABV?"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 51,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[<Record brewery_name='Schorschbräu' average_abv=28.087500000000002>]\n"
     ]
    }
   ],
   "source": [
    "# Which brewery produces the strongest beers according to ABV?\n",
    "\n",
    "query = \"\"\"\n",
    "        MATCH (br:BREWERIES)-[]->(b:BEERS)\n",
    "        WHERE b.abv <> 'nan'\n",
    "        WITH\n",
    "            distinct br.name as brewery_name,\n",
    "            TOFLOAT(b.abv) as abv_float\n",
    "        RETURN\n",
    "            brewery_name,\n",
    "            AVG(abv_float) AS average_abv\n",
    "        ORDER BY average_abv DESC\n",
    "        LIMIT 1\n",
    "    \"\"\"\n",
    "\n",
    "result = execute_read(driver, query)\n",
    "\n",
    "pprint(result)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### 8. If I typically enjoy a beer due to its aroma and appearance, which beer style should I try?"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 56,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[<Record beer_name='Big Hefe' average_smell=5.0 average_look=5.0>,\n",
      " <Record beer_name='Barrel Aged Shelf Beef' average_smell=5.0 average_look=5.0>,\n",
      " <Record beer_name='Batch Two' average_smell=5.0 average_look=5.0>,\n",
      " <Record beer_name='Dark HoRYEzon' average_smell=5.0 average_look=4.9375>,\n",
      " <Record beer_name='Doubleganger Guava' average_smell=5.0 average_look=4.916666666666667>,\n",
      " <Record beer_name='Imperial Mocha Java Stout' average_smell=5.0 average_look=4.833333333333333>,\n",
      " <Record beer_name='Campground Stout' average_smell=4.95 average_look=4.8>,\n",
      " <Record beer_name='Saison Lamoille Dry Hopped W/ Galaxy Cask' average_smell=4.9375 average_look=4.8125>,\n",
      " <Record beer_name='O.W.K.' average_smell=4.928571428571429 average_look=4.964285714285714>,\n",
      " <Record beer_name='Alpham Ale' average_smell=4.916666666666667 average_look=5.0>]\n"
     ]
    }
   ],
   "source": [
    "# ordered first by smell, then tie-breakers by look\n",
    "\n",
    "# if 'nan' value, we assume 0 for the review rating\n",
    "# (MAYBE FOR THIS WE CAN SUBSTITUTE BY r.score AS IT IS ALWAYS A NUMBER, INSTEAD OF 0)\n",
    "\n",
    "query = \"\"\"\n",
    "        MATCH (r:REVIEWS)<-[]-(b:BEERS)\n",
    "        WITH\n",
    "            b.name as beer_name,\n",
    "            TOFLOAT(CASE WHEN r.smell = 'nan' THEN 0 ELSE r.smell END) AS smell_float,\n",
    "            TOFLOAT(CASE WHEN r.look = 'nan' THEN 0 ELSE r.look END) AS look_float\n",
    "        RETURN \n",
    "            beer_name,\n",
    "            AVG(smell_float) AS average_smell,\n",
    "            AVG(look_float) AS average_look\n",
    "        ORDER BY average_smell DESC, average_look DESC\n",
    "        LIMIT 10\n",
    "\"\"\"\n",
    "\n",
    "result = execute_read(driver, query)\n",
    "\n",
    "pprint(result)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### 9. Using Graph Algorithms answer **one** of the following questions:\n",
    "    A. Which two countries are most similiar when it comes to their **top 10** most produced Beer styles?\n",
    "    B. Which beer is the most influential when considering the number of users who reviewed it?\n",
    "    C. Users are connected together by their reviews to beers, taking into consideration the \"overall\" score they review as a weight, how many communities are formed from these relationships? How many users are in the largest community?"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 32,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[<Record b.name='IPA' review_count=31387>,\n",
      " <Record b.name='Porter' review_count=21069>,\n",
      " <Record b.name='Imperial Stout' review_count=18601>,\n",
      " <Record b.name='Breakfast Stout' review_count=17580>,\n",
      " <Record b.name='Pale Ale' review_count=16978>]\n"
     ]
    }
   ],
   "source": [
    "# B. Which beer is the most influential when considering the number of users who reviewed it?\n",
    "query = \"\"\"\n",
    "        MATCH (b:BEERS)-[r:REVIEWED]->()-[]->(:USER)\n",
    "        RETURN\n",
    "                b.name,\n",
    "                COUNT(id(r)) as review_count\n",
    "        ORDER BY review_count DESC\n",
    "        LIMIT 5\n",
    "\"\"\"\n",
    "\n",
    "result = execute_read(driver, query)\n",
    "\n",
    "pprint(result)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### 10. Using Graph Algorithms answer **one** of the following questions:\n",
    "    A. Which beer has the most similar reviews as the beer `Super Bock Stout`?\n",
    "    B. Which user is the most influential when it comes to reviews made?"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 181,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[<Record u.name='Sammy' reviews_made=13797>]\n"
     ]
    }
   ],
   "source": [
    "# B. Which user is the most influential when it comes to reviews made?\n",
    "\n",
    "query = \"\"\"\n",
    "        MATCH (u:USER)<-[]-()\n",
    "        RETURN \n",
    "                u.name,\n",
    "                COUNT(*) as reviews_made\n",
    "        ORDER BY reviews_made DESC\n",
    "        LIMIT 1\n",
    "\"\"\"\n",
    "\n",
    "result = execute_read(driver, query)\n",
    "\n",
    "pprint(result)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### 11. If you had to pick 3 beers to recommend using only this database, which would you pick and why?"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 131,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[]\n"
     ]
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "        MATCH (r:REVIEWS)\n",
    "        WHERE r.score = 'nan'\n",
    "        RETURN r.id\n",
    "\"\"\"\n",
    "\n",
    "result = execute_read(driver, query)\n",
    "\n",
    "pprint(result)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 68,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[<Record b.name='Letra / Mean Sardine / Lervig - Barleywine - Port Barrel-Aged' final_score=12.8125>,\n",
      " <Record b.name='Iolanda' final_score=12.666666666666666>,\n",
      " <Record b.name='Mean Sardine / De Molen Ginja Ninja' final_score=12.5>]\n"
     ]
    }
   ],
   "source": [
    "# If you had to pick 3 beers to recommend using only this database, which would you pick and why?\n",
    "\n",
    "# In our opinion, the two most important attributes of a beer are the smell and taste, so \n",
    "# we calculated our final score factoring those two attributes individually, plus the \n",
    "# overall score of the beer, so we don't just use the smell and taste, but they have a \n",
    "# higher weight\n",
    "\n",
    "# In the cases of no overall score provided, we used the \"score\" attribute instead as\n",
    "# we did previous research as discovered there are no 'nan' values for the \"score\" field\n",
    "# (see in query above)\n",
    "\n",
    "\n",
    "query = \"\"\"\n",
    "        MATCH (r:REVIEWS)<-[:REVIEWED]-(b:BEERS)<-[]-()-[]->()-[]->(:COUNTRIES{name:'PT'})\n",
    "        WITH\n",
    "            b,\n",
    "            TOFLOAT(CASE WHEN r.taste = 'nan' THEN 2.5 ELSE r.taste END) AS taste_float,\n",
    "            TOFLOAT(CASE WHEN r.smell = 'nan' THEN 2.5 ELSE r.smell END) AS smell_float,\n",
    "            TOFLOAT(CASE WHEN r.overall = 'nan' THEN r.score ELSE r.overall END) AS overall_float\n",
    "        RETURN\n",
    "            b.name,\n",
    "            AVG(taste_float+smell_float+overall_float) as final_score\n",
    "        ORDER BY final_score DESC\n",
    "        LIMIT 3\n",
    "\"\"\"\n",
    "\n",
    "result = execute_read(driver, query)\n",
    "\n",
    "pprint(result)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# TRY 9"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 34,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Using the 'gds.graph.project.cypher' procedure, Which beer is the most influential when considering the number of users who reviewed it? \n",
    "\n",
    "query = \"\"\"\n",
    "        CALL gds.graph.project.cypher(\n",
    "            'beer_reviews_2',\n",
    "\n",
    "            'MATCH (n)\n",
    "            WHERE n:USER or n:BEERS\n",
    "            RETURN id(n) as id',\n",
    "\n",
    "            'MATCH (b:BEERS)-[r:REVIEWED]->()-[]->(u:USER)\n",
    "            RETURN id(u) as source, count(id(r)) as weight, id(b) as target\n",
    "            LIMIT 1000'\n",
    "        )\n",
    "\"\"\"\n",
    "\n",
    "result = execute_read(driver, query)\n",
    "\n",
    "pprint(result)\n",
    "\n",
    "query = \"\"\"\n",
    "        CALL gds.pageRank.stream('beer_reviews', {relationshipWeightProperty:'weight'})\n",
    "        YIELD nodeId, score\n",
    "        RETURN gds.util.asNode(nodeId).name AS beer, score\n",
    "        ORDER BY score DESC\n",
    "        LIMIT 5\n",
    "\"\"\"\n",
    "\n",
    "result = execute_read(driver, query)\n",
    "\n",
    "pprint(result)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[<Record graphName='beer_reviews'>]\n"
     ]
    }
   ],
   "source": [
    "# Step 0 - Clear graph, graph names need to be unique\n",
    "\n",
    "try:\n",
    "    query = \"\"\"\n",
    "            CALL gds.graph.drop('most_influential_beer') YIELD graphName;\n",
    "        \"\"\"\n",
    "\n",
    "    result = execute_read(driver, query)\n",
    "\n",
    "    pprint(result)\n",
    "except Exception as e:\n",
    "    pprint(e)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[<Record nodeQuery='MATCH (u) WHERE u:USER OR u:BEERS return id(u) AS id' relationshipQuery='MATCH (b:BEERS)-[]->(r:REVIEWS)-[]->(u:USER) \\n            RETURN id(u) AS source, id(r) as weight, id(b) AS target' graphName='most_influential_beer' nodeCount=882681 relationshipCount=9072895 projectMillis=75431>]\n"
     ]
    }
   ],
   "source": [
    "# Step 1 - Create an appropriate graph (a subgraph)\n",
    "\n",
    "try:\n",
    "    query = \"\"\"\n",
    "        CALL gds.graph.project.cypher(\n",
    "            'most_influential_beer',\n",
    "            \n",
    "            'MATCH (u) WHERE u:USER OR u:BEERS return id(u) AS id',\n",
    "            \n",
    "            'MATCH (b:BEERS)-[]->(r:REVIEWS)-[]->(u:USER) \n",
    "            RETURN id(u) AS source, id(r) as weight, id(b) AS target'\n",
    "            )\n",
    "      \"\"\"\n",
    "    result = execute_read(driver, query)\n",
    "    pprint(result)\n",
    "except Exception as e:\n",
    "    pprint(e)\n",
    "    \n",
    "#     First we find all the nodes of type User, and return only id values. Use limit while checking!\n",
    "#     Second we look up the nodes and their relationships"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CypherSyntaxError('Variable `n` not defined (line 4, column 23 (offset: 82))\\n\"            RETURN id(n) AS id\"\\n                       ^')\n"
     ]
    }
   ],
   "source": [
    "# Step 1 - part 1\n",
    "try:\n",
    "    query = \"\"\"\n",
    "            MATCH (u)\n",
    "            WHERE u:USER OR u:BEERS \n",
    "            RETURN id(n) AS id\n",
    "            LIMIT 5     \n",
    "        \"\"\"\n",
    "    result = execute_read(driver, query)\n",
    "    pprint(result)\n",
    "except Exception as e:\n",
    "    pprint(e)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[<Record source=9494326 weight=590677 target=391237>,\n",
      " <Record source=9494326 weight=9493383 target=383964>,\n",
      " <Record source=9494326 weight=9482867 target=383642>,\n",
      " <Record source=9494326 weight=9487876 target=383875>,\n",
      " <Record source=9494326 weight=9490585 target=383460>,\n",
      " <Record source=9494326 weight=9487438 target=383897>,\n",
      " <Record source=9494326 weight=9486825 target=383463>,\n",
      " <Record source=9494326 weight=9473217 target=383016>,\n",
      " <Record source=9494326 weight=9476280 target=382613>,\n",
      " <Record source=9494326 weight=9461714 target=381076>,\n",
      " <Record source=9494326 weight=9470942 target=383077>,\n",
      " <Record source=9494326 weight=9468794 target=383015>,\n",
      " <Record source=9494326 weight=9453228 target=382127>,\n",
      " <Record source=9494326 weight=9451854 target=382222>,\n",
      " <Record source=9494326 weight=9453587 target=382060>,\n",
      " <Record source=9494326 weight=9448644 target=381567>,\n",
      " <Record source=9494326 weight=9450483 target=382144>,\n",
      " <Record source=9494326 weight=9447387 target=381959>,\n",
      " <Record source=9494326 weight=9442186 target=381781>,\n",
      " <Record source=9494326 weight=9448840 target=381973>,\n",
      " <Record source=9494326 weight=9441641 target=381669>,\n",
      " <Record source=9494326 weight=9437123 target=381545>,\n",
      " <Record source=9494326 weight=9438979 target=381175>,\n",
      " <Record source=9494326 weight=9426015 target=380475>,\n",
      " <Record source=9494326 weight=9428494 target=381030>,\n",
      " <Record source=9494326 weight=9421644 target=380808>,\n",
      " <Record source=9494326 weight=9423237 target=380828>,\n",
      " <Record source=9494326 weight=9418381 target=380595>,\n",
      " <Record source=9494326 weight=9412807 target=380308>,\n",
      " <Record source=9494326 weight=9411144 target=380254>,\n",
      " <Record source=9494326 weight=9416668 target=380527>,\n",
      " <Record source=9494326 weight=9418405 target=380355>,\n",
      " <Record source=9494326 weight=9414784 target=380240>,\n",
      " <Record source=9494326 weight=9415507 target=380481>,\n",
      " <Record source=9494326 weight=9408538 target=379911>,\n",
      " <Record source=9494326 weight=9391873 target=379189>,\n",
      " <Record source=9494326 weight=9394825 target=379368>,\n",
      " <Record source=9494326 weight=9399849 target=379563>,\n",
      " <Record source=9494326 weight=9397291 target=379480>,\n",
      " <Record source=9494326 weight=9387869 target=378895>,\n",
      " <Record source=9494326 weight=9382961 target=378764>,\n",
      " <Record source=9494326 weight=9375723 target=378493>,\n",
      " <Record source=9494326 weight=9374565 target=378426>,\n",
      " <Record source=9494326 weight=9379568 target=378010>,\n",
      " <Record source=9494326 weight=9380887 target=378128>,\n",
      " <Record source=9494326 weight=9364459 target=377713>,\n",
      " <Record source=9494326 weight=9365299 target=377848>,\n",
      " <Record source=9494326 weight=9364149 target=376409>,\n",
      " <Record source=9494326 weight=9370081 target=377988>,\n",
      " <Record source=9494326 weight=9360812 target=376948>,\n",
      " <Record source=9494326 weight=9354326 target=377230>,\n",
      " <Record source=9494326 weight=9355540 target=377282>,\n",
      " <Record source=9494326 weight=9356927 target=376945>,\n",
      " <Record source=9494326 weight=9355142 target=377028>,\n",
      " <Record source=9494326 weight=9342994 target=376609>,\n",
      " <Record source=9494326 weight=9343498 target=376581>,\n",
      " <Record source=9494326 weight=9347753 target=376824>,\n",
      " <Record source=9494326 weight=9345983 target=376645>,\n",
      " <Record source=9494326 weight=9334339 target=375672>,\n",
      " <Record source=9494326 weight=9338053 target=376243>,\n",
      " <Record source=9494326 weight=9332427 target=375726>,\n",
      " <Record source=9494326 weight=9340475 target=375969>,\n",
      " <Record source=9494326 weight=9328626 target=375278>,\n",
      " <Record source=9494326 weight=9325018 target=375365>,\n",
      " <Record source=9494326 weight=9320313 target=375222>,\n",
      " <Record source=9494326 weight=9318280 target=374207>,\n",
      " <Record source=9494326 weight=9305863 target=374254>,\n",
      " <Record source=9494326 weight=9307884 target=374468>,\n",
      " <Record source=9494326 weight=9301865 target=374069>,\n",
      " <Record source=9494326 weight=9293011 target=372716>,\n",
      " <Record source=9494326 weight=9294961 target=373666>,\n",
      " <Record source=9494326 weight=9290920 target=373249>,\n",
      " <Record source=9494326 weight=9285684 target=373176>,\n",
      " <Record source=9494326 weight=9275743 target=372374>,\n",
      " <Record source=9494326 weight=9279594 target=370888>,\n",
      " <Record source=9494326 weight=9263020 target=371780>,\n",
      " <Record source=9494326 weight=9265589 target=371977>,\n",
      " <Record source=9494326 weight=9268614 target=372146>,\n",
      " <Record source=9494326 weight=9264615 target=371737>,\n",
      " <Record source=9494326 weight=9265060 target=372075>,\n",
      " <Record source=9494326 weight=9268725 target=371744>,\n",
      " <Record source=9494326 weight=9255119 target=371374>,\n",
      " <Record source=9494326 weight=9254634 target=371146>,\n",
      " <Record source=9494326 weight=9258004 target=371467>,\n",
      " <Record source=9494326 weight=9241477 target=370464>,\n",
      " <Record source=9494326 weight=9243082 target=370618>,\n",
      " <Record source=9494326 weight=9247621 target=370876>,\n",
      " <Record source=9494326 weight=9233826 target=369783>,\n",
      " <Record source=9494326 weight=9233252 target=369919>,\n",
      " <Record source=9494326 weight=9227337 target=368761>,\n",
      " <Record source=9494326 weight=9221545 target=368753>,\n",
      " <Record source=9494326 weight=9211351 target=368552>,\n",
      " <Record source=9494326 weight=9214442 target=368971>,\n",
      " <Record source=9494326 weight=9214175 target=369087>,\n",
      " <Record source=9494326 weight=9214326 target=368730>,\n",
      " <Record source=9494326 weight=9208878 target=368832>,\n",
      " <Record source=9494326 weight=9208403 target=368554>,\n",
      " <Record source=9494326 weight=9204962 target=368504>,\n",
      " <Record source=9494326 weight=9207617 target=368608>,\n",
      " <Record source=9494326 weight=9202089 target=368350>,\n",
      " <Record source=9494326 weight=9201599 target=368311>,\n",
      " <Record source=9494326 weight=9206056 target=368234>,\n",
      " <Record source=9494326 weight=9202404 target=367630>,\n",
      " <Record source=9494326 weight=9203304 target=367598>,\n",
      " <Record source=9494326 weight=9209099 target=368878>,\n",
      " <Record source=9494326 weight=9197510 target=367927>,\n",
      " <Record source=9494326 weight=9194852 target=366161>,\n",
      " <Record source=9494326 weight=9194614 target=368073>,\n",
      " <Record source=9494326 weight=9185669 target=367506>,\n",
      " <Record source=9494326 weight=9188114 target=367588>,\n",
      " <Record source=9494326 weight=9182461 target=367519>,\n",
      " <Record source=9494326 weight=9175247 target=367093>,\n",
      " <Record source=9494326 weight=9179151 target=367326>,\n",
      " <Record source=9494326 weight=9176301 target=366789>,\n",
      " <Record source=9494326 weight=9179850 target=366226>,\n",
      " <Record source=9494326 weight=9175171 target=367051>,\n",
      " <Record source=9494326 weight=9154286 target=366046>,\n",
      " <Record source=9494326 weight=9151655 target=365971>,\n",
      " <Record source=9494326 weight=9158464 target=366196>,\n",
      " <Record source=9494326 weight=9145047 target=365749>,\n",
      " <Record source=9494326 weight=9143027 target=365192>,\n",
      " <Record source=9494326 weight=9134925 target=363602>,\n",
      " <Record source=9494326 weight=9136734 target=364965>,\n",
      " <Record source=9494326 weight=9136810 target=365142>,\n",
      " <Record source=9494326 weight=9136874 target=365140>,\n",
      " <Record source=9494326 weight=9130166 target=364569>,\n",
      " <Record source=9494326 weight=9127066 target=364510>,\n",
      " <Record source=9494326 weight=9121329 target=363585>,\n",
      " <Record source=9494326 weight=9117388 target=363944>,\n",
      " <Record source=9494326 weight=9112760 target=363329>,\n",
      " <Record source=9494326 weight=9112383 target=363566>,\n",
      " <Record source=9494326 weight=9108269 target=363452>,\n",
      " <Record source=9494326 weight=9105100 target=362889>,\n",
      " <Record source=9494326 weight=9106138 target=363037>,\n",
      " <Record source=9494326 weight=9097976 target=362540>,\n",
      " <Record source=9494326 weight=9098242 target=362753>,\n",
      " <Record source=9494326 weight=9093469 target=362098>,\n",
      " <Record source=9494326 weight=9097510 target=362756>,\n",
      " <Record source=9494326 weight=9091781 target=362221>,\n",
      " <Record source=9494326 weight=9095188 target=362102>,\n",
      " <Record source=9494326 weight=9093120 target=362497>,\n",
      " <Record source=9494326 weight=9086027 target=362069>,\n",
      " <Record source=9494326 weight=9090659 target=362007>,\n",
      " <Record source=9494326 weight=9090284 target=362193>,\n",
      " <Record source=9494326 weight=9083691 target=361334>,\n",
      " <Record source=9494326 weight=9077103 target=357698>,\n",
      " <Record source=9494326 weight=9074712 target=359228>,\n",
      " <Record source=9494326 weight=9072597 target=361367>,\n",
      " <Record source=9494326 weight=9080766 target=361641>,\n",
      " <Record source=9494326 weight=9071310 target=361126>,\n",
      " <Record source=9494326 weight=9077166 target=361478>,\n",
      " <Record source=9494326 weight=9078176 target=361557>,\n",
      " <Record source=9494326 weight=9065483 target=360898>,\n",
      " <Record source=9494326 weight=9064849 target=360077>,\n",
      " <Record source=9494326 weight=9069638 target=361292>,\n",
      " <Record source=9494326 weight=9059710 target=360922>,\n",
      " <Record source=9494326 weight=9055904 target=360828>,\n",
      " <Record source=9494326 weight=9057205 target=360870>,\n",
      " <Record source=9494326 weight=9055683 target=360505>,\n",
      " <Record source=9494326 weight=9043475 target=359700>,\n",
      " <Record source=9494326 weight=9043090 target=359962>,\n",
      " <Record source=9494326 weight=9049908 target=360656>,\n",
      " <Record source=9494326 weight=9046466 target=359963>,\n",
      " <Record source=9494326 weight=9046521 target=360436>,\n",
      " <Record source=9494326 weight=9037954 target=359956>,\n",
      " <Record source=9494326 weight=9035184 target=360035>,\n",
      " <Record source=9494326 weight=9038366 target=360150>,\n",
      " <Record source=9494326 weight=9038454 target=360197>,\n",
      " <Record source=9494326 weight=9027667 target=359598>,\n",
      " <Record source=9494326 weight=9025032 target=359563>,\n",
      " <Record source=9494326 weight=9028351 target=359126>,\n",
      " <Record source=9494326 weight=9019515 target=359201>,\n",
      " <Record source=9494326 weight=9016475 target=358576>,\n",
      " <Record source=9494326 weight=9017753 target=359350>,\n",
      " <Record source=9494326 weight=9000171 target=358328>,\n",
      " <Record source=9494326 weight=8996827 target=358097>,\n",
      " <Record source=9494326 weight=8993981 target=358015>,\n",
      " <Record source=9494326 weight=8997938 target=357824>,\n",
      " <Record source=9494326 weight=8987920 target=357491>,\n",
      " <Record source=9494326 weight=8981164 target=357277>,\n",
      " <Record source=9494326 weight=8989987 target=357301>,\n",
      " <Record source=9494326 weight=8974321 target=357267>,\n",
      " <Record source=9494326 weight=8979717 target=357274>,\n",
      " <Record source=9494326 weight=8973048 target=357218>,\n",
      " <Record source=9494326 weight=8975744 target=357339>,\n",
      " <Record source=9494326 weight=8968993 target=357044>,\n",
      " <Record source=9494326 weight=8965101 target=356666>,\n",
      " <Record source=9494326 weight=8970692 target=357021>,\n",
      " <Record source=9494326 weight=8969611 target=357058>,\n",
      " <Record source=9494326 weight=8957809 target=354697>,\n",
      " <Record source=9494326 weight=8960327 target=356538>,\n",
      " <Record source=9494326 weight=8959589 target=356421>,\n",
      " <Record source=9494326 weight=8957472 target=356050>,\n",
      " <Record source=9494326 weight=8942182 target=355774>,\n",
      " <Record source=9494326 weight=8949254 target=355944>,\n",
      " <Record source=9494326 weight=8941402 target=355297>,\n",
      " <Record source=9494326 weight=8943542 target=355780>,\n",
      " <Record source=9494326 weight=8948716 target=355620>,\n",
      " <Record source=9494326 weight=8946502 target=355677>,\n",
      " <Record source=9494326 weight=8937986 target=354801>,\n",
      " <Record source=9494326 weight=8940663 target=355607>,\n",
      " <Record source=9494326 weight=8932207 target=354900>,\n",
      " <Record source=9494326 weight=8924835 target=354761>,\n",
      " <Record source=9494326 weight=8928129 target=354917>,\n",
      " <Record source=9494326 weight=8921461 target=353407>,\n",
      " <Record source=9494326 weight=8919093 target=354041>,\n",
      " <Record source=9494326 weight=8914590 target=353741>,\n",
      " <Record source=9494326 weight=8911231 target=354134>,\n",
      " <Record source=9494326 weight=8904973 target=353880>,\n",
      " <Record source=9494326 weight=8896936 target=352981>,\n",
      " <Record source=9494326 weight=8895465 target=352552>,\n",
      " <Record source=9494326 weight=8896564 target=353333>,\n",
      " <Record source=9494326 weight=8894054 target=353240>,\n",
      " <Record source=9494326 weight=8884648 target=352882>,\n",
      " <Record source=9494326 weight=8888744 target=352928>,\n",
      " <Record source=9494326 weight=8874920 target=352181>,\n",
      " <Record source=9494326 weight=8872318 target=352081>,\n",
      " <Record source=9494326 weight=8877838 target=351254>,\n",
      " <Record source=9494326 weight=8865203 target=351357>,\n",
      " <Record source=9494326 weight=8869429 target=351767>,\n",
      " <Record source=9494326 weight=8863103 target=351381>,\n",
      " <Record source=9494326 weight=8858343 target=350827>,\n",
      " <Record source=9494326 weight=8858979 target=348957>,\n",
      " <Record source=9494326 weight=8855711 target=350154>,\n",
      " <Record source=9494326 weight=8851932 target=350521>,\n",
      " <Record source=9494326 weight=8848327 target=349785>,\n",
      " <Record source=9494326 weight=8847299 target=350176>,\n",
      " <Record source=9494326 weight=8844801 target=350277>,\n",
      " <Record source=9494326 weight=8843419 target=349956>,\n",
      " <Record source=9494326 weight=8848512 target=350321>,\n",
      " <Record source=9494326 weight=8846370 target=350140>,\n",
      " <Record source=9494326 weight=8849029 target=350587>,\n",
      " <Record source=9494326 weight=8846327 target=349978>,\n",
      " <Record source=9494326 weight=8838917 target=348711>,\n",
      " <Record source=9494326 weight=8839283 target=347876>,\n",
      " <Record source=9494326 weight=8839867 target=349925>,\n",
      " <Record source=9494326 weight=8837751 target=348710>,\n",
      " <Record source=9494326 weight=8824330 target=349188>,\n",
      " <Record source=9494326 weight=8827353 target=349327>,\n",
      " <Record source=9494326 weight=8813511 target=348658>,\n",
      " <Record source=9494326 weight=8817569 target=348874>,\n",
      " <Record source=9494326 weight=8813538 target=348556>,\n",
      " <Record source=9494326 weight=8811161 target=348473>,\n",
      " <Record source=9494326 weight=8812310 target=348628>,\n",
      " <Record source=9494326 weight=8810928 target=348428>,\n",
      " <Record source=9494326 weight=8805401 target=348242>,\n",
      " <Record source=9494326 weight=8805382 target=348117>,\n",
      " <Record source=9494326 weight=8810185 target=348374>,\n",
      " <Record source=9494326 weight=8797976 target=347579>,\n",
      " <Record source=9494326 weight=8792790 target=347401>,\n",
      " <Record source=9494326 weight=8798645 target=347790>,\n",
      " <Record source=9494326 weight=8792741 target=347342>,\n",
      " <Record source=9494326 weight=8793120 target=347309>,\n",
      " <Record source=9494326 weight=8784752 target=346853>,\n",
      " <Record source=9494326 weight=8783568 target=345161>,\n",
      " <Record source=9494326 weight=8782939 target=345159>,\n",
      " <Record source=9494326 weight=8781837 target=346752>,\n",
      " <Record source=9494326 weight=8786698 target=346952>,\n",
      " <Record source=9494326 weight=8787780 target=346898>,\n",
      " <Record source=9494326 weight=8783131 target=346767>,\n",
      " <Record source=9494326 weight=8777885 target=346470>,\n",
      " <Record source=9494326 weight=8774288 target=346304>,\n",
      " <Record source=9494326 weight=8780652 target=346586>,\n",
      " <Record source=9494326 weight=8779047 target=346458>,\n",
      " <Record source=9494326 weight=8767284 target=344343>,\n",
      " <Record source=9494326 weight=8767742 target=345774>,\n",
      " <Record source=9494326 weight=8762306 target=345661>,\n",
      " <Record source=9494326 weight=8766171 target=345843>,\n",
      " <Record source=9494326 weight=8761538 target=345741>,\n",
      " <Record source=9494326 weight=8755341 target=345136>,\n",
      " <Record source=9494326 weight=8759125 target=345146>,\n",
      " <Record source=9494326 weight=8757319 target=345398>,\n",
      " <Record source=9494326 weight=8752414 target=344921>,\n",
      " <Record source=9494326 weight=8758282 target=345142>,\n",
      " <Record source=9494326 weight=8754281 target=345202>,\n",
      " <Record source=9494326 weight=8753911 target=345089>,\n",
      " <Record source=9494326 weight=8744701 target=344522>,\n",
      " <Record source=9494326 weight=8743431 target=343804>,\n",
      " <Record source=9494326 weight=8745579 target=344574>,\n",
      " <Record source=9494326 weight=8747644 target=344808>,\n",
      " <Record source=9494326 weight=8744510 target=344100>,\n",
      " <Record source=9494326 weight=8741778 target=344453>,\n",
      " <Record source=9494326 weight=8738117 target=344445>,\n",
      " <Record source=9494326 weight=8738990 target=344083>,\n",
      " <Record source=9494326 weight=8726683 target=343231>,\n",
      " <Record source=9494326 weight=8722110 target=342929>,\n",
      " <Record source=9494326 weight=8724361 target=343554>,\n",
      " <Record source=9494326 weight=8730535 target=344046>,\n",
      " <Record source=9494326 weight=8716071 target=342454>,\n",
      " <Record source=9494326 weight=8713902 target=343027>,\n",
      " <Record source=9494326 weight=8716330 target=343363>,\n",
      " <Record source=9494326 weight=8708809 target=342419>,\n",
      " <Record source=9494326 weight=8691207 target=341625>,\n",
      " <Record source=9494326 weight=8699597 target=342078>,\n",
      " <Record source=9494326 weight=8699326 target=341365>,\n",
      " <Record source=9494326 weight=8691877 target=341393>,\n",
      " <Record source=9494326 weight=8699746 target=340094>,\n",
      " <Record source=9494326 weight=8691672 target=339071>,\n",
      " <Record source=9494326 weight=8698253 target=341902>,\n",
      " <Record source=9494326 weight=8677630 target=340993>,\n",
      " <Record source=9494326 weight=8680384 target=340255>,\n",
      " <Record source=9494326 weight=8677244 target=340942>,\n",
      " <Record source=9494326 weight=8663447 target=340209>,\n",
      " <Record source=9494326 weight=8665650 target=340426>,\n",
      " <Record source=9494326 weight=8666624 target=340291>,\n",
      " <Record source=9494326 weight=8661618 target=340026>,\n",
      " <Record source=9494326 weight=8655707 target=339656>,\n",
      " <Record source=9494326 weight=8654283 target=339770>,\n",
      " <Record source=9494326 weight=8650556 target=339462>,\n",
      " <Record source=9494326 weight=8647839 target=339370>,\n",
      " <Record source=9494326 weight=8649682 target=339445>,\n",
      " <Record source=9494326 weight=8645486 target=339300>,\n",
      " <Record source=9494326 weight=8632660 target=337558>,\n",
      " <Record source=9494326 weight=8632265 target=338346>,\n",
      " <Record source=9494326 weight=8631265 target=338336>,\n",
      " <Record source=9494326 weight=8634684 target=338132>,\n",
      " <Record source=9494326 weight=8621902 target=337833>,\n",
      " <Record source=9494326 weight=8625541 target=336363>,\n",
      " <Record source=9494326 weight=8615593 target=337482>,\n",
      " <Record source=9494326 weight=8620486 target=337815>,\n",
      " <Record source=9494326 weight=8613705 target=337412>,\n",
      " <Record source=9494326 weight=8614954 target=337465>,\n",
      " <Record source=9494326 weight=8616614 target=337628>,\n",
      " <Record source=9494326 weight=8601390 target=336335>,\n",
      " <Record source=9494326 weight=8602483 target=336691>,\n",
      " <Record source=9494326 weight=8609301 target=337035>,\n",
      " <Record source=9494326 weight=8606934 target=336927>,\n",
      " <Record source=9494326 weight=8600374 target=336371>,\n",
      " <Record source=9494326 weight=8598503 target=335505>,\n",
      " <Record source=9494326 weight=8581613 target=335533>,\n",
      " <Record source=9494326 weight=8586128 target=335487>,\n",
      " <Record source=9494326 weight=8582883 target=335237>,\n",
      " <Record source=9494326 weight=8587699 target=335879>,\n",
      " <Record source=9494326 weight=8577007 target=335322>,\n",
      " <Record source=9494326 weight=8579560 target=335154>,\n",
      " <Record source=9494326 weight=8578985 target=335057>,\n",
      " <Record source=9494326 weight=8572496 target=334950>,\n",
      " <Record source=9494326 weight=8557925 target=334139>,\n",
      " <Record source=9494326 weight=8551625 target=333590>,\n",
      " <Record source=9494326 weight=8560095 target=334112>,\n",
      " <Record source=9494326 weight=8559701 target=334259>,\n",
      " <Record source=9494326 weight=8560447 target=334325>,\n",
      " <Record source=9494326 weight=8557580 target=334132>,\n",
      " <Record source=9494326 weight=8550363 target=333118>,\n",
      " <Record source=9494326 weight=8550540 target=333053>,\n",
      " <Record source=9494326 weight=8543151 target=333286>,\n",
      " <Record source=9494326 weight=8549557 target=333635>,\n",
      " <Record source=9494326 weight=8544720 target=333477>,\n",
      " <Record source=9494326 weight=8542979 target=333367>,\n",
      " <Record source=9494326 weight=8538731 target=332969>,\n",
      " <Record source=9494326 weight=8531890 target=332641>,\n",
      " <Record source=9494326 weight=8521510 target=331845>,\n",
      " <Record source=9494326 weight=8511111 target=331168>,\n",
      " <Record source=9494326 weight=8519468 target=331659>,\n",
      " <Record source=9494326 weight=8507462 target=331070>,\n",
      " <Record source=9494326 weight=8507666 target=330934>,\n",
      " <Record source=9494326 weight=8502317 target=330679>,\n",
      " <Record source=9494326 weight=8510055 target=331159>,\n",
      " <Record source=9494326 weight=8503431 target=330434>,\n",
      " <Record source=9494326 weight=8505558 target=331031>,\n",
      " <Record source=9494326 weight=8491180 target=329964>,\n",
      " <Record source=9494326 weight=8489577 target=329759>,\n",
      " <Record source=9494326 weight=8483992 target=329469>,\n",
      " <Record source=9494326 weight=8490502 target=329806>,\n",
      " <Record source=9494326 weight=8472433 target=319729>,\n",
      " <Record source=9494326 weight=8471167 target=329287>,\n",
      " <Record source=9494326 weight=8462555 target=328850>,\n",
      " <Record source=9494326 weight=8457572 target=328540>,\n",
      " <Record source=9494326 weight=8456000 target=328406>,\n",
      " <Record source=9494326 weight=8441214 target=327082>,\n",
      " <Record source=9494326 weight=8443677 target=327526>,\n",
      " <Record source=9494326 weight=8443609 target=327515>,\n",
      " <Record source=9494326 weight=8448974 target=328005>,\n",
      " <Record source=9494326 weight=8441141 target=327186>,\n",
      " <Record source=9494326 weight=8433558 target=327109>,\n",
      " <Record source=9494326 weight=8440769 target=327379>,\n",
      " <Record source=9494326 weight=8437362 target=327293>,\n",
      " <Record source=9494326 weight=8439277 target=327366>,\n",
      " <Record source=9494326 weight=8437731 target=327347>,\n",
      " <Record source=9494326 weight=8433880 target=327018>,\n",
      " <Record source=9494326 weight=8424073 target=326440>,\n",
      " <Record source=9494326 weight=8424988 target=325732>,\n",
      " <Record source=9494326 weight=8423612 target=326086>,\n",
      " <Record source=9494326 weight=8415369 target=324904>,\n",
      " <Record source=9494326 weight=8413368 target=326152>,\n",
      " <Record source=9494326 weight=8412397 target=326255>,\n",
      " <Record source=9494326 weight=8416556 target=326322>,\n",
      " <Record source=9494326 weight=8416913 target=326306>,\n",
      " <Record source=9494326 weight=8420360 target=325507>,\n",
      " <Record source=9494326 weight=8401707 target=325704>,\n",
      " <Record source=9494326 weight=8408392 target=326072>,\n",
      " <Record source=9494326 weight=8410103 target=326159>,\n",
      " <Record source=9494326 weight=8383879 target=324375>,\n",
      " <Record source=9494326 weight=8389822 target=324875>,\n",
      " <Record source=9494326 weight=8382018 target=324449>,\n",
      " <Record source=9494326 weight=8379950 target=324335>,\n",
      " <Record source=9494326 weight=8380503 target=324356>,\n",
      " <Record source=9494326 weight=8377623 target=323600>,\n",
      " <Record source=9494326 weight=8363899 target=322930>,\n",
      " <Record source=9494326 weight=8367342 target=323319>,\n",
      " <Record source=9494326 weight=8366912 target=323240>,\n",
      " <Record source=9494326 weight=8368492 target=323418>,\n",
      " <Record source=9494326 weight=8359604 target=322729>,\n",
      " <Record source=9494326 weight=8352141 target=322179>,\n",
      " <Record source=9494326 weight=8351228 target=322333>,\n",
      " <Record source=9494326 weight=8345828 target=321888>,\n",
      " <Record source=9494326 weight=8346110 target=321625>,\n",
      " <Record source=9494326 weight=8348042 target=322108>,\n",
      " <Record source=9494326 weight=8350729 target=322272>,\n",
      " <Record source=9494326 weight=8332897 target=320894>,\n",
      " <Record source=9494326 weight=8336573 target=321436>,\n",
      " <Record source=9494326 weight=8336287 target=321414>,\n",
      " <Record source=9494326 weight=8328230 target=320169>,\n",
      " <Record source=9494326 weight=8325199 target=320368>,\n",
      " <Record source=9494326 weight=8330923 target=320806>,\n",
      " <Record source=9494326 weight=8329597 target=320218>,\n",
      " <Record source=9494326 weight=8319007 target=319822>,\n",
      " <Record source=9494326 weight=8319678 target=319828>,\n",
      " <Record source=9494326 weight=8319664 target=319957>,\n",
      " <Record source=9494326 weight=8313974 target=319461>,\n",
      " <Record source=9494326 weight=8320229 target=319959>,\n",
      " <Record source=9494326 weight=8315799 target=319542>,\n",
      " <Record source=9494326 weight=8311184 target=319399>,\n",
      " <Record source=9494326 weight=8301133 target=318884>,\n",
      " <Record source=9494326 weight=8306659 target=319204>,\n",
      " <Record source=9494326 weight=8307746 target=319172>,\n",
      " <Record source=9494326 weight=8292859 target=318150>,\n",
      " <Record source=9494326 weight=8295208 target=318339>,\n",
      " <Record source=9494326 weight=8296742 target=318586>,\n",
      " <Record source=9494326 weight=8298913 target=318800>,\n",
      " <Record source=9494326 weight=8283129 target=317322>,\n",
      " <Record source=9494326 weight=8290094 target=317925>,\n",
      " <Record source=9494326 weight=8282973 target=317270>,\n",
      " <Record source=9494326 weight=8285137 target=317525>,\n",
      " <Record source=9494326 weight=8288109 target=318007>,\n",
      " <Record source=9494326 weight=8290684 target=317969>,\n",
      " <Record source=9494326 weight=8283418 target=317286>,\n",
      " <Record source=9494326 weight=8273394 target=316843>,\n",
      " <Record source=9494326 weight=8272364 target=316197>,\n",
      " <Record source=9494326 weight=8280318 target=317246>,\n",
      " <Record source=9494326 weight=8272517 target=316693>,\n",
      " <Record source=9494326 weight=8275965 target=316920>,\n",
      " <Record source=9494326 weight=8278410 target=317163>,\n",
      " <Record source=9494326 weight=8271840 target=316678>,\n",
      " <Record source=9494326 weight=8271069 target=316549>,\n",
      " <Record source=9494326 weight=8261495 target=316360>,\n",
      " <Record source=9494326 weight=8261866 target=316309>,\n",
      " <Record source=9494326 weight=8267464 target=316503>,\n",
      " <Record source=9494326 weight=8260655 target=316194>,\n",
      " <Record source=9494326 weight=8257527 target=315933>,\n",
      " <Record source=9494326 weight=8258254 target=315990>,\n",
      " <Record source=9494326 weight=8259092 target=316011>,\n",
      " <Record source=9494326 weight=8251299 target=315652>,\n",
      " <Record source=9494326 weight=8249539 target=315471>,\n",
      " <Record source=9494326 weight=8242937 target=315215>,\n",
      " <Record source=9494326 weight=8234451 target=314774>,\n",
      " <Record source=9494326 weight=8239053 target=315132>,\n",
      " <Record source=9494326 weight=8223232 target=314288>,\n",
      " <Record source=9494326 weight=8212197 target=314062>,\n",
      " <Record source=9494326 weight=8211278 target=313919>,\n",
      " <Record source=9494326 weight=8219695 target=314192>,\n",
      " <Record source=9494326 weight=8209898 target=313911>,\n",
      " <Record source=9494326 weight=8203297 target=313458>,\n",
      " <Record source=9494326 weight=8206034 target=313560>,\n",
      " <Record source=9494326 weight=8206562 target=312502>,\n",
      " <Record source=9494326 weight=8205383 target=313697>,\n",
      " <Record source=9494326 weight=8209477 target=313950>,\n",
      " <Record source=9494326 weight=8192028 target=312896>,\n",
      " <Record source=9494326 weight=8196451 target=313306>,\n",
      " <Record source=9494326 weight=8192925 target=312967>,\n",
      " <Record source=9494326 weight=8199884 target=313482>,\n",
      " <Record source=9494326 weight=8195307 target=313231>,\n",
      " <Record source=9494326 weight=8194641 target=312489>,\n",
      " <Record source=9494326 weight=8184828 target=312424>,\n",
      " <Record source=9494326 weight=8188759 target=312444>,\n",
      " <Record source=9494326 weight=8188062 target=312531>,\n",
      " <Record source=9494326 weight=8174640 target=311763>,\n",
      " <Record source=9494326 weight=8179921 target=312024>,\n",
      " <Record source=9494326 weight=8169474 target=311223>,\n",
      " <Record source=9494326 weight=8166287 target=311296>,\n",
      " <Record source=9494326 weight=8165600 target=311134>,\n",
      " <Record source=9494326 weight=8165552 target=310722>,\n",
      " <Record source=9494326 weight=8159670 target=310979>,\n",
      " <Record source=9494326 weight=8142157 target=310016>,\n",
      " <Record source=9494326 weight=8147993 target=310336>,\n",
      " <Record source=9494326 weight=8147137 target=310168>,\n",
      " <Record source=9494326 weight=8137190 target=309050>,\n",
      " <Record source=9494326 weight=8132741 target=309487>,\n",
      " <Record source=9494326 weight=8141036 target=309740>,\n",
      " <Record source=9494326 weight=8141014 target=309832>,\n",
      " <Record source=9494326 weight=8132460 target=309264>,\n",
      " <Record source=9494326 weight=8130404 target=308859>,\n",
      " <Record source=9494326 weight=8127497 target=309119>,\n",
      " <Record source=9494326 weight=8129314 target=309281>,\n",
      " <Record source=9494326 weight=8115397 target=308310>,\n",
      " <Record source=9494326 weight=8112752 target=308015>,\n",
      " <Record source=9494326 weight=8116965 target=308356>,\n",
      " <Record source=9494326 weight=8102741 target=307620>,\n",
      " <Record source=9494326 weight=8110884 target=307803>,\n",
      " <Record source=9494326 weight=8098247 target=307322>,\n",
      " <Record source=9494326 weight=8092275 target=306743>,\n",
      " <Record source=9494326 weight=8090688 target=306774>,\n",
      " <Record source=9494326 weight=8089858 target=306722>,\n",
      " <Record source=9494326 weight=8082365 target=306034>,\n",
      " <Record source=9494326 weight=8082083 target=306015>,\n",
      " <Record source=9494326 weight=8075173 target=305381>,\n",
      " <Record source=9494326 weight=8061990 target=304920>,\n",
      " <Record source=9494326 weight=8069397 target=305325>,\n",
      " <Record source=9494326 weight=8067889 target=305245>,\n",
      " <Record source=9494326 weight=8055813 target=304582>,\n",
      " <Record source=9494326 weight=8046562 target=304160>,\n",
      " <Record source=9494326 weight=8041699 target=303956>,\n",
      " <Record source=9494326 weight=8046098 target=304154>,\n",
      " <Record source=9494326 weight=8043343 target=304097>,\n",
      " <Record source=9494326 weight=8033311 target=303706>,\n",
      " <Record source=9494326 weight=8035263 target=303802>,\n",
      " <Record source=9494326 weight=8023233 target=303093>,\n",
      " <Record source=9494326 weight=8029453 target=303519>,\n",
      " <Record source=9494326 weight=8021106 target=301648>,\n",
      " <Record source=9494326 weight=8016707 target=302633>,\n",
      " <Record source=9494326 weight=8020236 target=302852>,\n",
      " <Record source=9494326 weight=8014012 target=302451>,\n",
      " <Record source=9494326 weight=8002349 target=301795>,\n",
      " <Record source=9494326 weight=8001887 target=301769>,\n",
      " <Record source=9494326 weight=8010232 target=301618>,\n",
      " <Record source=9494326 weight=8001842 target=301379>,\n",
      " <Record source=9494326 weight=7997921 target=301358>,\n",
      " <Record source=9494326 weight=7997335 target=301400>,\n",
      " <Record source=9494326 weight=7995081 target=301242>,\n",
      " <Record source=9494326 weight=7995005 target=301222>,\n",
      " <Record source=9494326 weight=7992767 target=301062>,\n",
      " <Record source=9494326 weight=7993418 target=301075>,\n",
      " <Record source=9494326 weight=7988001 target=300887>,\n",
      " <Record source=9494326 weight=7984427 target=300627>,\n",
      " <Record source=9494326 weight=7987619 target=300876>,\n",
      " <Record source=9494326 weight=7981606 target=300541>,\n",
      " <Record source=9494326 weight=7986896 target=300787>,\n",
      " <Record source=9494326 weight=7989317 target=300913>,\n",
      " <Record source=9494326 weight=7983546 target=300592>,\n",
      " <Record source=9494326 weight=7971386 target=298393>,\n",
      " <Record source=9494326 weight=7973278 target=300122>,\n",
      " <Record source=9494326 weight=7974347 target=300233>,\n",
      " <Record source=9494326 weight=7969097 target=299696>,\n",
      " <Record source=9494326 weight=7963522 target=298384>,\n",
      " <Record source=9494326 weight=7957103 target=299073>,\n",
      " <Record source=9494326 weight=7951615 target=298689>,\n",
      " <Record source=9494326 weight=7960007 target=299243>,\n",
      " <Record source=9494326 weight=7958145 target=299128>,\n",
      " <Record source=9494326 weight=7959412 target=299152>,\n",
      " <Record source=9494326 weight=7956246 target=299001>,\n",
      " <Record source=9494326 weight=7954909 target=298731>,\n",
      " <Record source=9494326 weight=7954654 target=298363>,\n",
      " <Record source=9494326 weight=7949773 target=298352>,\n",
      " <Record source=9494326 weight=7943192 target=298150>,\n",
      " <Record source=9494326 weight=7950437 target=298353>,\n",
      " <Record source=9494326 weight=7946192 target=298274>,\n",
      " <Record source=9494326 weight=7933371 target=297631>,\n",
      " <Record source=9494326 weight=7940887 target=297992>,\n",
      " <Record source=9494326 weight=7935797 target=297810>,\n",
      " <Record source=9494326 weight=7925745 target=297348>,\n",
      " <Record source=9494326 weight=7927931 target=297388>,\n",
      " <Record source=9494326 weight=7922015 target=297045>,\n",
      " <Record source=9494326 weight=7922917 target=297193>,\n",
      " <Record source=9494326 weight=7912326 target=296286>,\n",
      " <Record source=9494326 weight=7920995 target=297023>,\n",
      " <Record source=9494326 weight=7916753 target=296730>,\n",
      " <Record source=9494326 weight=7905028 target=295955>,\n",
      " <Record source=9494326 weight=7906735 target=295997>,\n",
      " <Record source=9494326 weight=7901175 target=295903>,\n",
      " <Record source=9494326 weight=7909843 target=296201>,\n",
      " <Record source=9494326 weight=7910015 target=296211>,\n",
      " <Record source=9494326 weight=7909546 target=296031>,\n",
      " <Record source=9494326 weight=7900800 target=295904>,\n",
      " <Record source=9494326 weight=7895620 target=295627>,\n",
      " <Record source=9494326 weight=7893874 target=295511>,\n",
      " <Record source=9494326 weight=7886629 target=295280>,\n",
      " <Record source=9494326 weight=7883430 target=295159>,\n",
      " <Record source=9494326 weight=7887224 target=295328>,\n",
      " <Record source=9494326 weight=7889044 target=295464>,\n",
      " <Record source=9494326 weight=7879164 target=294846>,\n",
      " <Record source=9494326 weight=7872203 target=294477>,\n",
      " <Record source=9494326 weight=7880317 target=294925>,\n",
      " <Record source=9494326 weight=7873865 target=294535>,\n",
      " <Record source=9494326 weight=7876043 target=294693>,\n",
      " <Record source=9494326 weight=7870894 target=294424>,\n",
      " <Record source=9494326 weight=7867715 target=294347>,\n",
      " <Record source=9494326 weight=7843378 target=292782>,\n",
      " <Record source=9494326 weight=7835960 target=292063>,\n",
      " <Record source=9494326 weight=7834178 target=292259>,\n",
      " <Record source=9494326 weight=7823294 target=291751>,\n",
      " <Record source=9494326 weight=7821448 target=291519>,\n",
      " <Record source=9494326 weight=7827958 target=291931>,\n",
      " <Record source=9494326 weight=7827433 target=291854>,\n",
      " <Record source=9494326 weight=7817857 target=291273>,\n",
      " <Record source=9494326 weight=7811528 target=290955>,\n",
      " <Record source=9494326 weight=7820650 target=291565>,\n",
      " <Record source=9494326 weight=7812398 target=291085>,\n",
      " <Record source=9494326 weight=7819086 target=291446>,\n",
      " <Record source=9494326 weight=7820246 target=291487>,\n",
      " <Record source=9494326 weight=7818778 target=291305>,\n",
      " <Record source=9494326 weight=7812980 target=291090>,\n",
      " <Record source=9494326 weight=7819919 target=291485>,\n",
      " <Record source=9494326 weight=7809836 target=290954>,\n",
      " <Record source=9494326 weight=7804046 target=290879>,\n",
      " <Record source=9494326 weight=7791863 target=290397>,\n",
      " <Record source=9494326 weight=7795435 target=290469>,\n",
      " <Record source=9494326 weight=7798923 target=290657>,\n",
      " <Record source=9494326 weight=7790340 target=290342>,\n",
      " <Record source=9494326 weight=7783613 target=289979>,\n",
      " <Record source=9494326 weight=7785455 target=290003>,\n",
      " <Record source=9494326 weight=7786801 target=290218>,\n",
      " <Record source=9494326 weight=7775229 target=289672>,\n",
      " <Record source=9494326 weight=7776578 target=289607>,\n",
      " <Record source=9494326 weight=7775319 target=289678>,\n",
      " <Record source=9494326 weight=7769839 target=289609>,\n",
      " <Record source=9494326 weight=7763065 target=289360>,\n",
      " <Record source=9494326 weight=7761658 target=289227>,\n",
      " <Record source=9494326 weight=7769562 target=289547>,\n",
      " <Record source=9494326 weight=7751730 target=288854>,\n",
      " <Record source=9494326 weight=7757926 target=289060>,\n",
      " <Record source=9494326 weight=7751970 target=288855>,\n",
      " <Record source=9494326 weight=7755332 target=289048>,\n",
      " <Record source=9494326 weight=7757342 target=289054>,\n",
      " <Record source=9494326 weight=7753857 target=288976>,\n",
      " <Record source=9494326 weight=7743568 target=288445>,\n",
      " <Record source=9494326 weight=7744183 target=288462>,\n",
      " <Record source=9494326 weight=7749986 target=288794>,\n",
      " <Record source=9494326 weight=7744826 target=288532>,\n",
      " <Record source=9494326 weight=7746262 target=288693>,\n",
      " <Record source=9494326 weight=7734466 target=288150>,\n",
      " <Record source=9494326 weight=7731572 target=287936>,\n",
      " <Record source=9494326 weight=7736645 target=288207>,\n",
      " <Record source=9494326 weight=7728734 target=287689>,\n",
      " <Record source=9494326 weight=7727510 target=287538>,\n",
      " <Record source=9494326 weight=7730587 target=287888>,\n",
      " <Record source=9494326 weight=7722936 target=287230>,\n",
      " <Record source=9494326 weight=7729498 target=287734>,\n",
      " <Record source=9494326 weight=7729963 target=287850>,\n",
      " <Record source=9494326 weight=7720750 target=287247>,\n",
      " <Record source=9494326 weight=7712310 target=286706>,\n",
      " <Record source=9494326 weight=7716465 target=286934>,\n",
      " <Record source=9494326 weight=7714327 target=286740>,\n",
      " <Record source=9494326 weight=7710910 target=286481>,\n",
      " <Record source=9494326 weight=7696852 target=285294>,\n",
      " <Record source=9494326 weight=7700185 target=285466>,\n",
      " <Record source=9494326 weight=7699326 target=285508>,\n",
      " <Record source=9494326 weight=7690037 target=285024>,\n",
      " <Record source=9494326 weight=7684901 target=284624>,\n",
      " <Record source=9494326 weight=7688769 target=284873>,\n",
      " <Record source=9494326 weight=7672197 target=283867>,\n",
      " <Record source=9494326 weight=7666412 target=283519>,\n",
      " <Record source=9494326 weight=7666965 target=283546>,\n",
      " <Record source=9494326 weight=7667790 target=283624>,\n",
      " <Record source=9494326 weight=7667324 target=283616>,\n",
      " <Record source=9494326 weight=7654267 target=282900>,\n",
      " <Record source=9494326 weight=7659397 target=282652>,\n",
      " <Record source=9494326 weight=7652111 target=282873>,\n",
      " <Record source=9494326 weight=7651693 target=282631>,\n",
      " <Record source=9494326 weight=7658025 target=282970>,\n",
      " <Record source=9494326 weight=7649280 target=282610>,\n",
      " <Record source=9494326 weight=7646841 target=282676>,\n",
      " <Record source=9494326 weight=7649742 target=282611>,\n",
      " <Record source=9494326 weight=7644774 target=282244>,\n",
      " <Record source=9494326 weight=7642400 target=282405>,\n",
      " <Record source=9494326 weight=7643482 target=282515>,\n",
      " <Record source=9494326 weight=7650181 target=282710>,\n",
      " <Record source=9494326 weight=7637079 target=282146>,\n",
      " <Record source=9494326 weight=7632430 target=281843>,\n",
      " <Record source=9494326 weight=7632050 target=281840>,\n",
      " <Record source=9494326 weight=7631111 target=281834>,\n",
      " <Record source=9494326 weight=7640471 target=282334>,\n",
      " <Record source=9494326 weight=7623215 target=281270>,\n",
      " <Record source=9494326 weight=7627218 target=281544>,\n",
      " <Record source=9494326 weight=7622295 target=281239>,\n",
      " <Record source=9494326 weight=7624733 target=281412>,\n",
      " <Record source=9494326 weight=7626590 target=281104>,\n",
      " <Record source=9494326 weight=7629298 target=281757>,\n",
      " <Record source=9494326 weight=7628133 target=281579>,\n",
      " <Record source=9494326 weight=7623108 target=281269>,\n",
      " <Record source=9494326 weight=7621272 target=281212>,\n",
      " <Record source=9494326 weight=7620723 target=281123>,\n",
      " <Record source=9494326 weight=7614440 target=280813>,\n",
      " <Record source=9494326 weight=7607919 target=280569>,\n",
      " <Record source=9494326 weight=7602383 target=280462>,\n",
      " <Record source=9494326 weight=7593799 target=280075>,\n",
      " <Record source=9494326 weight=7596073 target=280301>,\n",
      " <Record source=9494326 weight=7599289 target=280210>,\n",
      " <Record source=9494326 weight=7597315 target=280203>,\n",
      " <Record source=9494326 weight=7591375 target=279711>,\n",
      " <Record source=9494326 weight=7584387 target=279503>,\n",
      " <Record source=9494326 weight=7584748 target=279506>,\n",
      " <Record source=9494326 weight=7587671 target=279777>,\n",
      " <Record source=9494326 weight=7588788 target=279850>,\n",
      " <Record source=9494326 weight=7582459 target=279437>,\n",
      " <Record source=9494326 weight=7586120 target=279674>,\n",
      " <Record source=9494326 weight=7588611 target=279848>,\n",
      " <Record source=9494326 weight=7572334 target=279078>,\n",
      " <Record source=9494326 weight=7577532 target=279378>,\n",
      " <Record source=9494326 weight=7575124 target=279136>,\n",
      " <Record source=9494326 weight=7562621 target=278814>,\n",
      " <Record source=9494326 weight=7553247 target=278220>,\n",
      " <Record source=9494326 weight=7551981 target=277847>,\n",
      " <Record source=9494326 weight=7551879 target=278190>,\n",
      " <Record source=9494326 weight=7560900 target=278261>,\n",
      " <Record source=9494326 weight=7559145 target=278438>,\n",
      " <Record source=9494326 weight=7556614 target=278422>,\n",
      " <Record source=9494326 weight=7544564 target=277719>,\n",
      " <Record source=9494326 weight=7543039 target=277675>,\n",
      " <Record source=9494326 weight=7544167 target=277718>,\n",
      " <Record source=9494326 weight=7549752 target=278045>,\n",
      " <Record source=9494326 weight=7541226 target=277369>,\n",
      " <Record source=9494326 weight=7535369 target=277326>,\n",
      " <Record source=9494326 weight=7533059 target=277134>,\n",
      " <Record source=9494326 weight=7532801 target=277073>,\n",
      " <Record source=9494326 weight=7530490 target=276915>,\n",
      " <Record source=9494326 weight=7523604 target=276725>,\n",
      " <Record source=9494326 weight=7524039 target=276754>,\n",
      " <Record source=9494326 weight=7521923 target=276662>,\n",
      " <Record source=9494326 weight=7507582 target=276051>,\n",
      " <Record source=9494326 weight=7501638 target=276058>,\n",
      " <Record source=9494326 weight=7505484 target=276277>,\n",
      " <Record source=9494326 weight=7492548 target=275650>,\n",
      " <Record source=9494326 weight=7499628 target=276006>,\n",
      " <Record source=9494326 weight=7492413 target=275684>,\n",
      " <Record source=9494326 weight=7500314 target=276007>,\n",
      " <Record source=9494326 weight=7484131 target=274670>,\n",
      " <Record source=9494326 weight=7481771 target=274791>,\n",
      " <Record source=9494326 weight=7487981 target=275259>,\n",
      " <Record source=9494326 weight=7482274 target=274801>,\n",
      " <Record source=9494326 weight=7490208 target=275461>,\n",
      " <Record source=9494326 weight=7488070 target=275087>,\n",
      " <Record source=9494326 weight=7485628 target=275038>,\n",
      " <Record source=9494326 weight=7473854 target=274404>,\n",
      " <Record source=9494326 weight=7479905 target=274633>,\n",
      " <Record source=9494326 weight=7472732 target=274399>,\n",
      " <Record source=9494326 weight=7475197 target=274358>,\n",
      " <Record source=9494326 weight=7477362 target=274571>,\n",
      " <Record source=9494326 weight=7464894 target=274118>,\n",
      " <Record source=9494326 weight=7470063 target=274174>,\n",
      " <Record source=9494326 weight=7468712 target=274173>,\n",
      " <Record source=9494326 weight=7470505 target=274387>,\n",
      " <Record source=9494326 weight=7454624 target=273616>,\n",
      " <Record source=9494326 weight=7457716 target=273903>,\n",
      " <Record source=9494326 weight=7456233 target=273752>,\n",
      " <Record source=9494326 weight=7443609 target=273145>,\n",
      " <Record source=9494326 weight=7446353 target=273276>,\n",
      " <Record source=9494326 weight=7423431 target=272628>,\n",
      " <Record source=9494326 weight=7415230 target=272094>,\n",
      " <Record source=9494326 weight=7420566 target=272502>,\n",
      " <Record source=9494326 weight=7418564 target=272455>,\n",
      " <Record source=9494326 weight=7417473 target=272252>,\n",
      " <Record source=9494326 weight=7411590 target=271777>,\n",
      " <Record source=9494326 weight=7402080 target=271556>,\n",
      " <Record source=9494326 weight=7406623 target=271754>,\n",
      " <Record source=9494326 weight=7409865 target=271775>,\n",
      " <Record source=9494326 weight=7391613 target=271123>,\n",
      " <Record source=9494326 weight=7388076 target=271012>,\n",
      " <Record source=9494326 weight=7386836 target=270963>,\n",
      " <Record source=9494326 weight=7373641 target=270451>,\n",
      " <Record source=9494326 weight=7366708 target=270135>,\n",
      " <Record source=9494326 weight=7364578 target=269996>,\n",
      " <Record source=9494326 weight=7366927 target=270137>,\n",
      " <Record source=9494326 weight=7370152 target=270450>,\n",
      " <Record source=9494326 weight=7361442 target=269790>,\n",
      " <Record source=9494326 weight=7359460 target=269691>,\n",
      " <Record source=9494326 weight=7359278 target=269577>,\n",
      " <Record source=9494326 weight=7357406 target=269536>,\n",
      " <Record source=9494326 weight=7348900 target=269069>,\n",
      " <Record source=9494326 weight=7344723 target=268735>,\n",
      " <Record source=9494326 weight=7350335 target=269114>,\n",
      " <Record source=9494326 weight=7339368 target=268275>,\n",
      " <Record source=9494326 weight=7337001 target=268188>,\n",
      " <Record source=9494326 weight=7338615 target=268192>,\n",
      " <Record source=9494326 weight=7334857 target=268311>,\n",
      " <Record source=9494326 weight=7326937 target=267927>,\n",
      " <Record source=9494326 weight=7324892 target=267916>,\n",
      " <Record source=9494326 weight=7323581 target=267878>,\n",
      " <Record source=9494326 weight=7322160 target=267805>,\n",
      " <Record source=9494326 weight=7311548 target=267343>,\n",
      " <Record source=9494326 weight=7312503 target=267363>,\n",
      " <Record source=9494326 weight=7319968 target=267576>,\n",
      " <Record source=9494326 weight=7318492 target=267465>,\n",
      " <Record source=9494326 weight=7302675 target=266968>,\n",
      " <Record source=9494326 weight=7310100 target=267289>,\n",
      " <Record source=9494326 weight=7302069 target=266906>,\n",
      " <Record source=9494326 weight=7309473 target=267256>,\n",
      " <Record source=9494326 weight=7307909 target=267101>,\n",
      " <Record source=9494326 weight=7307344 target=267100>,\n",
      " <Record source=9494326 weight=7299272 target=266664>,\n",
      " <Record source=9494326 weight=7300048 target=266810>,\n",
      " <Record source=9494326 weight=7288544 target=266384>,\n",
      " <Record source=9494326 weight=7282022 target=266293>,\n",
      " <Record source=9494326 weight=7277552 target=266102>,\n",
      " <Record source=9494326 weight=7272100 target=265835>,\n",
      " <Record source=9494326 weight=7280217 target=266153>,\n",
      " <Record source=9494326 weight=7273708 target=265900>,\n",
      " <Record source=9494326 weight=7274824 target=265782>,\n",
      " <Record source=9494326 weight=7266533 target=265722>,\n",
      " <Record source=9494326 weight=7261110 target=265187>,\n",
      " <Record source=9494326 weight=7253385 target=264942>,\n",
      " <Record source=9494326 weight=7259353 target=265318>,\n",
      " <Record source=9494326 weight=7257134 target=265140>,\n",
      " <Record source=9494326 weight=7256761 target=265136>,\n",
      " <Record source=9494326 weight=7257542 target=265210>,\n",
      " <Record source=9494326 weight=7250286 target=264794>,\n",
      " <Record source=9494326 weight=7245416 target=264458>,\n",
      " <Record source=9494326 weight=7249427 target=264643>,\n",
      " <Record source=9494326 weight=7240176 target=264100>,\n",
      " <Record source=9494326 weight=7231518 target=263969>,\n",
      " <Record source=9494326 weight=7233434 target=263902>,\n",
      " <Record source=9494326 weight=7223327 target=263446>,\n",
      " <Record source=9494326 weight=7228170 target=263742>,\n",
      " <Record source=9494326 weight=7224650 target=263512>,\n",
      " <Record source=9494326 weight=7228637 target=263770>,\n",
      " <Record source=9494326 weight=7225888 target=263520>,\n",
      " <Record source=9494326 weight=7220438 target=263258>,\n",
      " <Record source=9494326 weight=7211672 target=262731>,\n",
      " <Record source=9494326 weight=7217371 target=263040>,\n",
      " <Record source=9494326 weight=7219729 target=263201>,\n",
      " <Record source=9494326 weight=7203626 target=262168>,\n",
      " <Record source=9494326 weight=7205521 target=262458>,\n",
      " <Record source=9494326 weight=7208558 target=262173>,\n",
      " <Record source=9494326 weight=7202020 target=262163>,\n",
      " <Record source=9494326 weight=7195430 target=261815>,\n",
      " <Record source=9494326 weight=7194372 target=262027>,\n",
      " <Record source=9494326 weight=7185665 target=261905>,\n",
      " <Record source=9494326 weight=7185905 target=261975>,\n",
      " <Record source=9494326 weight=7172449 target=261382>,\n",
      " <Record source=9494326 weight=7179178 target=261744>,\n",
      " <Record source=9494326 weight=7172303 target=261380>,\n",
      " <Record source=9494326 weight=7169695 target=261250>,\n",
      " <Record source=9494326 weight=7166113 target=261065>,\n",
      " <Record source=9494326 weight=7160439 target=260929>,\n",
      " <Record source=9494326 weight=7159535 target=260901>,\n",
      " <Record source=9494326 weight=7149251 target=260739>,\n",
      " <Record source=9494326 weight=7143949 target=260337>,\n",
      " <Record source=9494326 weight=7134024 target=260410>,\n",
      " <Record source=9494326 weight=7121123 target=259925>,\n",
      " <Record source=9494326 weight=7117870 target=259429>,\n",
      " <Record source=9494326 weight=7114320 target=259704>,\n",
      " <Record source=9494326 weight=7120163 target=259844>,\n",
      " <Record source=9494326 weight=7108234 target=259476>,\n",
      " <Record source=9494326 weight=7094955 target=259017>,\n",
      " <Record source=9494326 weight=7101038 target=259329>,\n",
      " <Record source=9494326 weight=7087730 target=258476>,\n",
      " <Record source=9494326 weight=7089212 target=258570>,\n",
      " <Record source=9494326 weight=7080763 target=258197>,\n",
      " <Record source=9494326 weight=7077987 target=257893>,\n",
      " <Record source=9494326 weight=7079272 target=258024>,\n",
      " <Record source=9494326 weight=7076153 target=257541>,\n",
      " <Record source=9494326 weight=7079800 target=258125>,\n",
      " <Record source=9494326 weight=7065115 target=257242>,\n",
      " <Record source=9494326 weight=7061625 target=257150>,\n",
      " <Record source=9494326 weight=7070068 target=257615>,\n",
      " <Record source=9494326 weight=7069654 target=257593>,\n",
      " <Record source=9494326 weight=7051523 target=256387>,\n",
      " <Record source=9494326 weight=7058992 target=256986>,\n",
      " <Record source=9494326 weight=7058214 target=256758>,\n",
      " <Record source=9494326 weight=7052902 target=256688>,\n",
      " <Record source=9494326 weight=7035556 target=256111>,\n",
      " <Record source=9494326 weight=7037400 target=256240>,\n",
      " <Record source=9494326 weight=7034862 target=255916>,\n",
      " <Record source=9494326 weight=7034229 target=256057>,\n",
      " <Record source=9494326 weight=7038933 target=255938>,\n",
      " <Record source=9494326 weight=7027738 target=255818>,\n",
      " <Record source=9494326 weight=7028843 target=255860>,\n",
      " <Record source=9494326 weight=7027232 target=255778>,\n",
      " <Record source=9494326 weight=7026876 target=255425>,\n",
      " <Record source=9494326 weight=7016202 target=255341>,\n",
      " <Record source=9494326 weight=7014899 target=254946>,\n",
      " <Record source=9494326 weight=7017759 target=255463>,\n",
      " <Record source=9494326 weight=7020261 target=255402>,\n",
      " <Record source=9494326 weight=7009296 target=255130>,\n",
      " <Record source=9494326 weight=7007861 target=255107>,\n",
      " <Record source=9494326 weight=7005173 target=255078>,\n",
      " <Record source=9494326 weight=7001669 target=255012>,\n",
      " <Record source=9494326 weight=6998405 target=254768>,\n",
      " <Record source=9494326 weight=6981671 target=254001>,\n",
      " <Record source=9494326 weight=6989125 target=254023>,\n",
      " <Record source=9494326 weight=6989631 target=254335>,\n",
      " <Record source=9494326 weight=6990708 target=254453>,\n",
      " <Record source=9494326 weight=6973326 target=253593>,\n",
      " <Record source=9494326 weight=6968668 target=253292>,\n",
      " <Record source=9494326 weight=6971045 target=253489>,\n",
      " <Record source=9494326 weight=6970755 target=253456>,\n",
      " <Record source=9494326 weight=6964501 target=253149>,\n",
      " <Record source=9494326 weight=6961889 target=252872>,\n",
      " <Record source=9494326 weight=6965228 target=253089>,\n",
      " <Record source=9494326 weight=6970536 target=253059>,\n",
      " <Record source=9494326 weight=6962618 target=252966>,\n",
      " <Record source=9494326 weight=6953143 target=252543>,\n",
      " <Record source=9494326 weight=6955540 target=252762>,\n",
      " <Record source=9494326 weight=6955964 target=252622>,\n",
      " <Record source=9494326 weight=6944715 target=252157>,\n",
      " <Record source=9494326 weight=6949289 target=252222>,\n",
      " <Record source=9494326 weight=6943178 target=252063>,\n",
      " <Record source=9494326 weight=6932771 target=251604>,\n",
      " <Record source=9494326 weight=6933051 target=251638>,\n",
      " <Record source=9494326 weight=6925044 target=251234>,\n",
      " <Record source=9494326 weight=6924006 target=251204>,\n",
      " <Record source=9494326 weight=6929216 target=251268>,\n",
      " <Record source=9494326 weight=6927214 target=251461>,\n",
      " <Record source=9494326 weight=6911088 target=250625>,\n",
      " <Record source=9494326 weight=6917693 target=250791>,\n",
      " <Record source=9494326 weight=6918474 target=250939>,\n",
      " <Record source=9494326 weight=6915765 target=250412>,\n",
      " <Record source=9494326 weight=6901496 target=250137>,\n",
      " <Record source=9494326 weight=6908237 target=250544>,\n",
      " <Record source=9494326 weight=6901344 target=250047>,\n",
      " <Record source=9494326 weight=6908925 target=250495>,\n",
      " <Record source=9494326 weight=6904974 target=250257>,\n",
      " <Record source=9494326 weight=6901942 target=250160>,\n",
      " <Record source=9494326 weight=6905675 target=250261>,\n",
      " <Record source=9494326 weight=6902358 target=250233>,\n",
      " <Record source=9494326 weight=6892283 target=249566>,\n",
      " <Record source=9494326 weight=6898628 target=249812>,\n",
      " <Record source=9494326 weight=6900814 target=250113>,\n",
      " <Record source=9494326 weight=6896760 target=249901>,\n",
      " <Record source=9494326 weight=6890863 target=249537>,\n",
      " <Record source=9494326 weight=6885385 target=249316>,\n",
      " <Record source=9494326 weight=6889159 target=249344>,\n",
      " <Record source=9494326 weight=6887668 target=249457>,\n",
      " <Record source=9494326 weight=6888313 target=249500>,\n",
      " <Record source=9494326 weight=6874842 target=249132>,\n",
      " <Record source=9494326 weight=6874683 target=249104>,\n",
      " <Record source=9494326 weight=6874680 target=249129>,\n",
      " <Record source=9494326 weight=6863270 target=248684>,\n",
      " <Record source=9494326 weight=6861392 target=248716>,\n",
      " <Record source=9494326 weight=6863570 target=248797>,\n",
      " <Record source=9494326 weight=6868845 target=248998>,\n",
      " <Record source=9494326 weight=6862332 target=248420>,\n",
      " <Record source=9494326 weight=6852703 target=248580>,\n",
      " <Record source=9494326 weight=6856595 target=248415>,\n",
      " <Record source=9494326 weight=6851405 target=248545>,\n",
      " <Record source=9494326 weight=6850538 target=248395>,\n",
      " <Record source=9494326 weight=6843684 target=248098>,\n",
      " <Record source=9494326 weight=6835750 target=247750>,\n",
      " <Record source=9494326 weight=6838670 target=247794>,\n",
      " <Record source=9494326 weight=6829426 target=247262>,\n",
      " <Record source=9494326 weight=6821516 target=246577>,\n",
      " <Record source=9494326 weight=6827592 target=247060>,\n",
      " <Record source=9494326 weight=6811232 target=246163>,\n",
      " <Record source=9494326 weight=6815927 target=246488>,\n",
      " <Record source=9494326 weight=6812391 target=246236>,\n",
      " <Record source=9494326 weight=6796350 target=245385>,\n",
      " <Record source=9494326 weight=6800930 target=245602>,\n",
      " <Record source=9494326 weight=6794628 target=245341>,\n",
      " <Record source=9494326 weight=6789560 target=244941>,\n",
      " <Record source=9494326 weight=6787016 target=244892>,\n",
      " <Record source=9494326 weight=6788544 target=244942>,\n",
      " <Record source=9494326 weight=6781657 target=244505>,\n",
      " <Record source=9494326 weight=6782247 target=244579>,\n",
      " <Record source=9494326 weight=6786233 target=244751>,\n",
      " <Record source=9494326 weight=6780187 target=244491>,\n",
      " <Record source=9494326 weight=6767353 target=244144>,\n",
      " <Record source=9494326 weight=6765531 target=243895>,\n",
      " <Record source=9494326 weight=6757863 target=243975>,\n",
      " <Record source=9494326 weight=6744655 target=242952>,\n",
      " <Record source=9494326 weight=6741392 target=243005>,\n",
      " <Record source=9494326 weight=6744537 target=243276>,\n",
      " <Record source=9494326 weight=6746350 target=243506>,\n",
      " <Record source=9494326 weight=6747355 target=243536>,\n",
      " <Record source=9494326 weight=6750593 target=243405>,\n",
      " <Record source=9494326 weight=6738784 target=242853>,\n",
      " <Record source=9494326 weight=6721566 target=242461>,\n",
      " <Record source=9494326 weight=6727545 target=242628>,\n",
      " <Record source=9494326 weight=6716615 target=242341>,\n",
      " <Record source=9494326 weight=6711176 target=242164>,\n",
      " <Record source=9494326 weight=6712069 target=242175>,\n",
      " <Record source=9494326 weight=6708702 target=242018>,\n",
      " <Record source=9494326 weight=6711022 target=241870>,\n",
      " <Record source=9494326 weight=6703017 target=241703>,\n",
      " <Record source=9494326 weight=6707152 target=241406>,\n",
      " <Record source=9494326 weight=6709878 target=241993>,\n",
      " <Record source=9494326 weight=6705330 target=241622>,\n",
      " <Record source=9494326 weight=6682758 target=241248>,\n",
      " <Record source=9494326 weight=6674901 target=240905>,\n",
      " <Record source=9494326 weight=6672449 target=240696>,\n",
      " <Record source=9494326 weight=6674621 target=240898>,\n",
      " <Record source=9494326 weight=6680708 target=241227>,\n",
      " <Record source=9494326 weight=6669058 target=240574>,\n",
      " <Record source=9494326 weight=6662382 target=240237>,\n",
      " <Record source=9494326 weight=6669721 target=240681>,\n",
      " <Record source=9494326 weight=6662783 target=240245>,\n",
      " <Record source=9494326 weight=6657690 target=239820>,\n",
      " <Record source=9494326 weight=6654831 target=240004>,\n",
      " <Record source=9494326 weight=6651293 target=239965>,\n",
      " <Record source=9494326 weight=6642391 target=239809>,\n",
      " <Record source=9494326 weight=6644095 target=239912>,\n",
      " <Record source=9494326 weight=6644054 target=239911>,\n",
      " <Record source=9494326 weight=6636086 target=239641>,\n",
      " <Record source=9494326 weight=6637656 target=239686>,\n",
      " <Record source=9494326 weight=6633978 target=239451>,\n",
      " <Record source=9494326 weight=6634684 target=239583>,\n",
      " <Record source=9494326 weight=6622465 target=238389>,\n",
      " <Record source=9494326 weight=6623672 target=238719>,\n",
      " <Record source=9494326 weight=6623408 target=238713>,\n",
      " <Record source=9494326 weight=6622847 target=238393>,\n",
      " <Record source=9494326 weight=6624016 target=238733>,\n",
      " <Record source=9494326 weight=6616081 target=238032>]\n"
     ]
    }
   ],
   "source": [
    "# Step 1 - part 2\n",
    "try:\n",
    "    query = \"\"\"\n",
    "            MATCH (b:BEERS)-[]->(r:REVIEWS)-[]->(u:USER)\n",
    "            RETURN id(u) AS source, id(r) as weight, id(b) AS target\n",
    "            LIMIT 1000\n",
    "        \"\"\"\n",
    "\n",
    "    result = execute_read(driver, query)\n",
    "\n",
    "    pprint(result)\n",
    "except Exception as e:\n",
    "    pprint(e)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[<Record name='Heady Topper' score=224.85759823799071>,\n",
      " <Record name='Pliny The Elder' score=143.50298784750825>,\n",
      " <Record name='Breakfast Stout' score=120.64217537364006>,\n",
      " <Record name='Zombie Dust' score=112.18268707095876>,\n",
      " <Record name='Sculpin IPA' score=108.22204980698254>]\n"
     ]
    }
   ],
   "source": [
    "# Step 2 - Run the algorithm\n",
    "\n",
    "try:\n",
    "    query = \"\"\"\n",
    "        CALL gds.pageRank.stream('most_influential_beer', {relationshipWeightProperty:'weight'})\n",
    "            \n",
    "            YIELD nodeId, score\n",
    "            \n",
    "            RETURN gds.util.asNode(nodeId).name AS name, score\n",
    "            \n",
    "            ORDER BY score desc\n",
    "            LIMIT 5\n",
    "        \"\"\"\n",
    "    result = execute_read(driver, query)\n",
    "    pprint(result)\n",
    "except Exception as e:\n",
    "    pprint(e)\n",
    "    \n",
    "# yield: In the stream execution mode, the algorithm returns the score for each node. \n",
    "# This allows us to inspect the results directly or post-process them in Cypher without any side effects.    \n",
    "# return: retrieves username based on node ID, and the calculated score"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "hide_input": false,
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.4"
  },
  "toc": {
   "base_numbering": 1,
   "nav_menu": {},
   "number_sections": true,
   "sideBar": true,
   "skip_h1_title": false,
   "title_cell": "Table of Contents",
   "title_sidebar": "Contents",
   "toc_cell": false,
   "toc_position": {},
   "toc_section_display": true,
   "toc_window_display": false
  },
  "varInspector": {
   "cols": {
    "lenName": 16,
    "lenType": 16,
    "lenVar": 40
   },
   "kernels_config": {
    "python": {
     "delete_cmd_postfix": "",
     "delete_cmd_prefix": "del ",
     "library": "var_list.py",
     "varRefreshCmd": "print(var_dic_list())"
    },
    "r": {
     "delete_cmd_postfix": ") ",
     "delete_cmd_prefix": "rm(",
     "library": "var_list.r",
     "varRefreshCmd": "cat(var_dic_list()) "
    }
   },
   "types_to_exclude": [
    "module",
    "function",
    "builtin_function_or_method",
    "instance",
    "_Feature"
   ],
   "window_display": false
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
